{
  "recipes": [
    {
      "name": "Meat Sauce",
      "description": "A classic meat sauce that's perfect for pasta.",
      "ingredients": [
        "400 g ground beef",
        "1 onion, chopped",
        "2 garlic cloves, minced",
        "1 can crushed tomatoes (400 g)",
        "1 tbsp tomato paste",
        "1 tsp oregano",
        "Salt and pepper",
        "Oil for frying"
      ],
      "instructions": [
        "Heat the oil in a frying pan. Add the onion and garlic and sauté until soft.",
        "Add the ground beef and brown it until fully cooked.",
        "Stir in the crushed tomatoes, tomato paste, and oregano. Let it simmer for 15-20 minutes.",
        "Season with salt and pepper. Serve with pasta."
      ],
      "type": "Meat"
    },
    {
      "name": "Grilled Steak",
      "description": "A simple, flavorful grilled steak seasoned with garlic and herbs.",
      "ingredients": [
        "2 steaks",
        "2 garlic cloves, minced",
        "1 tbsp olive oil",
        "1 tsp rosemary",
        "Salt and pepper"
      ],
      "instructions": [
        "Preheat the grill to medium-high heat.",
        "Rub the steaks with olive oil, garlic, rosemary, salt, and pepper.",
        "Grill the steaks for 4-5 minutes on each side, depending on desired doneness.",
        "Let the steak rest for 5 minutes before serving."
      ],
      "type": "Meat"
    },
    {
      "name": "Beef Stroganoff",
      "description": "A creamy beef dish with mushrooms and sour cream.",
      "ingredients": [
        "500 g beef strips",
        "1 onion, chopped",
        "200 g mushrooms, sliced",
        "1 cup sour cream",
        "1 tbsp Dijon mustard",
        "Salt and pepper",
        "Oil for frying"
      ],
      "instructions": [
        "Heat oil in a frying pan and cook the onions and mushrooms until soft.",
        "Add the beef strips and cook until browned.",
        "Stir in the sour cream and Dijon mustard. Let it simmer for 5-10 minutes.",
        "Season with salt and pepper, and serve with rice or pasta."
      ],
      "type": "Meat"
    },
    {
      "name": "Roast Chicken",
      "description": "A tender and flavorful roast chicken with garlic and herbs.",
      "ingredients": [
        "1 whole chicken",
        "2 tbsp olive oil",
        "3 garlic cloves, minced",
        "1 tbsp thyme",
        "Salt and pepper"
      ],
      "instructions": [
        "Preheat the oven to 180°C (350°F).",
        "Rub the chicken with olive oil, garlic, thyme, salt, and pepper.",
        "Roast in the oven for 1 hour or until fully cooked.",
        "Let the chicken rest for 10 minutes before carving."
      ],
      "type": "Meat"
    },
    {
      "name": "Baked Lamb Chops",
      "description": "Juicy lamb chops baked with rosemary and garlic.",
      "ingredients": [
        "4 lamb chops",
        "2 garlic cloves, minced",
        "1 tbsp rosemary",
        "Salt and pepper",
        "Olive oil"
      ],
      "instructions": [
        "Preheat the oven to 200°C (400°F).",
        "Rub the lamb chops with olive oil, garlic, rosemary, salt, and pepper.",
        "Bake for 15-20 minutes or until cooked to your liking.",
        "Let the chops rest for 5 minutes before serving."
      ],
      "type": "Meat"
    },
    {
      "name": "Oven-Baked Salmon",
      "description": "A simple and flavorful dish where the salmon is baked with lemon and herbs.",
      "ingredients": [
        "4 salmon fillets",
        "2 lemons, sliced",
        "2 tbsp olive oil",
        "1 tsp dill",
        "Salt and pepper"
      ],
      "instructions": [
        "Preheat the oven to 200°C (400°F).",
        "Place the salmon fillets in a baking dish. Drizzle with olive oil and season with dill, salt, and pepper.",
        "Place the lemon slices on top of the salmon.",
        "Bake in the oven for 15-20 minutes or until the salmon is cooked through."
      ],
      "type": "Fish"
    },
    {
      "name": "Fish Tacos",
      "description": "Crispy fish fillets served in soft tacos with fresh toppings.",
      "ingredients": [
        "500 g white fish fillets, cut into strips",
        "1 cup flour",
        "1 tsp paprika",
        "1 tsp cumin",
        "Salt and pepper",
        "Taco shells",
        "Toppings: lettuce, salsa, avocado"
      ],
      "instructions": [
        "Coat the fish fillets in flour, paprika, cumin, salt, and pepper.",
        "Fry the fish in oil until crispy and golden.",
        "Assemble the tacos by placing fish strips in taco shells and adding toppings like lettuce, salsa, and avocado."
      ],
      "type": "Fish"
    },
    {
      "name": "Grilled Tuna Steaks",
      "description": "Seared tuna steaks with a garlic and soy marinade.",
      "ingredients": [
        "2 tuna steaks",
        "2 tbsp soy sauce",
        "1 garlic clove, minced",
        "1 tsp ginger, grated",
        "Olive oil"
      ],
      "instructions": [
        "Marinate the tuna steaks in soy sauce, garlic, ginger, and olive oil for 30 minutes.",
        "Grill the tuna steaks for 2-3 minutes on each side, until seared.",
        "Serve with a side salad."
      ],
      "type": "Fish"
    },
    {
      "name": "Tomato Basil Soup",
      "description": "A creamy and flavorful tomato soup with fresh basil.",
      "ingredients": [
        "1 tbsp olive oil",
        "1 onion, chopped",
        "2 garlic cloves, minced",
        "800 g canned tomatoes",
        "2 cups vegetable broth",
        "1/2 cup heavy cream",
        "1/4 cup fresh basil, chopped",
        "Salt and pepper"
      ],
      "instructions": [
        "Heat olive oil in a pot over medium heat. Add onion and garlic, sauté until soft.",
        "Add canned tomatoes and vegetable broth, and bring to a simmer.",
        "Let it cook for 15 minutes, then blend until smooth.",
        "Stir in the cream, add basil, and season with salt and pepper. Serve warm."
      ],
      "type": "Soup"
    },
    {
      "name": "Minestrone Soup",
      "description": "A hearty Italian vegetable soup with pasta and beans.",
      "ingredients": [
        "2 tbsp olive oil",
        "1 onion, chopped",
        "2 carrots, sliced",
        "2 zucchinis, chopped",
        "1 can kidney beans, drained",
        "1 can diced tomatoes",
        "4 cups vegetable broth",
        "1 cup pasta",
        "Salt and pepper"
      ],
      "instructions": [
        "Heat olive oil in a large pot and sauté the onion and carrots until soft.",
        "Add zucchini, beans, tomatoes, and vegetable broth. Bring to a simmer.",
        "Add pasta and cook until tender, about 10-12 minutes.",
        "Season with salt and pepper before serving."
      ],
      "type": "Soup"
    },
    {
      "name": "French Onion Soup",
      "description": "A rich, savory onion soup topped with cheesy croutons.",
      "ingredients": [
        "6 onions, sliced",
        "2 tbsp butter",
        "1/4 cup white wine",
        "4 cups beef broth",
        "French bread slices",
        "Gruyère cheese"
      ],
      "instructions": [
        "Caramelize the onions in butter over low heat until golden brown.",
        "Deglaze the pan with white wine and add the beef broth. Simmer for 30 minutes.",
        "Top with toasted French bread slices and melted Gruyère cheese."
      ],
      "type": "Soup"
    },
    {
      "name": "Chicken Caesar Salad",
      "description": "A hearty Caesar salad topped with grilled chicken.",
      "ingredients": [
        "2 chicken breasts, grilled and sliced",
        "1 head Romaine lettuce, chopped",
        "1/2 cup croutons",
        "1/4 cup Caesar dressing",
        "Parmesan cheese, shaved"
      ],
      "instructions": [
        "Toss the chopped lettuce with Caesar dressing.",
        "Top with grilled chicken slices, croutons, and Parmesan cheese.",
        "Serve immediately."
      ],
      "type": "Salad"
    },

    {
      "name": "Chocolate Lava Cake",
      "description": "A rich and gooey chocolate cake with a molten center, perfect for chocolate lovers.",
      "ingredients": [
        "200 g dark chocolate",
        "100 g butter",
        "2 eggs",
        "2 egg yolks",
        "50 g sugar",
        "30 g flour",
        "A pinch of salt"
      ],
      "instructions": [
        "Preheat the oven to 200°C (400°F). Grease four ramekins with butter and dust with flour.",
        "Melt the chocolate and butter in a heatproof bowl over simmering water.",
        "In a separate bowl, whisk together eggs, egg yolks, and sugar until thick and pale.",
        "Gently fold the melted chocolate mixture into the egg mixture. Sift in flour and salt, and mix until just combined.",
        "Divide the batter between the ramekins and bake for 12-14 minutes until the edges are firm but the center is still soft.",
        "Let them sit for 1 minute, then invert onto plates and serve immediately, perhaps with ice cream."
      ],
      "type": "Dessert"
    },
    {
      "name": "Tiramisu",
      "description": "A classic Italian dessert made with coffee-soaked ladyfingers and mascarpone cheese.",
      "ingredients": [
        "250 g mascarpone cheese",
        "3 eggs, separated",
        "75 g sugar",
        "1 cup strong coffee, cooled",
        "24 ladyfingers",
        "Cocoa powder for dusting",
        "A splash of coffee liqueur (optional)"
      ],
      "instructions": [
        "In a bowl, whisk the egg yolks and sugar until thick and pale. Add mascarpone cheese and mix until smooth.",
        "In a separate bowl, whisk the egg whites until stiff peaks form, then gently fold into the mascarpone mixture.",
        "Quickly dip each ladyfinger in coffee (and liqueur, if using) and layer them in a dish.",
        "Spread half of the mascarpone mixture over the ladyfingers. Repeat with another layer of dipped ladyfingers and mascarpone.",
        "Cover and refrigerate for at least 4 hours. Dust with cocoa powder before serving."
      ],
      "type": "Dessert"
    },
    {
      "name": "Butternut Squash Soup",
      "description": "A creamy and comforting soup made with roasted butternut squash and spices.",
      "ingredients": [
        "1 butternut squash, peeled and cubed",
        "1 onion, chopped",
        "2 garlic cloves, minced",
        "4 cups vegetable broth",
        "1 tsp ground cumin",
        "1/2 tsp nutmeg",
        "Salt and pepper to taste",
        "2 tbsp olive oil"
      ],
      "instructions": [
        "Preheat the oven to 200°C (400°F). Toss the butternut squash with olive oil, salt, and pepper, and roast for 25-30 minutes until tender.",
        "In a pot, heat some olive oil over medium heat. Sauté the onion and garlic until soft.",
        "Add the roasted squash, vegetable broth, cumin, and nutmeg. Bring to a boil, then reduce heat and simmer for 10 minutes.",
        "Blend until smooth using an immersion blender or a regular blender. Adjust seasoning if necessary."
      ],
      "type": "Soup"
    },
    {
      "name": "Creamy Tomato Basil Soup",
      "description": "A rich and creamy tomato soup with fresh basil, perfect for pairing with grilled cheese.",
      "ingredients": [
        "2 tbsp olive oil",
        "1 onion, chopped",
        "2 garlic cloves, minced",
        "800 g canned tomatoes",
        "2 cups vegetable broth",
        "1/2 cup heavy cream",
        "1/4 cup fresh basil, chopped",
        "Salt and pepper to taste"
      ],
      "instructions": [
        "In a pot, heat olive oil over medium heat. Add onion and garlic and sauté until softened.",
        "Add canned tomatoes and vegetable broth. Bring to a simmer and cook for 15 minutes.",
        "Blend the soup until smooth. Stir in heavy cream and basil, and season with salt and pepper before serving."
      ],
      "type": "Soup"
    },
    {
      "name": "Caesar Salad",
      "description": "A classic Caesar salad topped with grilled chicken, croutons, and Parmesan cheese.",
      "ingredients": [
        "2 chicken breasts, grilled and sliced",
        "1 head Romaine lettuce, chopped",
        "1/2 cup croutons",
        "1/4 cup Caesar dressing",
        "Parmesan cheese, shaved",
        "Salt and pepper to taste"
      ],
      "instructions": [
        "In a large bowl, toss chopped Romaine lettuce with Caesar dressing.",
        "Top with sliced grilled chicken, croutons, and shaved Parmesan cheese.",
        "Serve immediately with extra dressing on the side, if desired."
      ],
      "type": "Salad"
    },
    {
      "name": "Greek Salad",
      "description": "A fresh and vibrant Greek salad with tomatoes, cucumbers, olives, and feta cheese.",
      "ingredients": [
        "2 cups cherry tomatoes, halved",
        "1 cucumber, diced",
        "1/2 red onion, thinly sliced",
        "1/2 cup Kalamata olives",
        "100 g feta cheese, crumbled",
        "2 tbsp olive oil",
        "1 tbsp red wine vinegar",
        "Salt and pepper to taste"
      ],
      "instructions": [
        "In a large bowl, combine cherry tomatoes, cucumber, red onion, and olives.",
        "Drizzle with olive oil and red wine vinegar, and toss to combine.",
        "Top with crumbled feta cheese and season with salt and pepper before serving."
      ],
      "type": "Salad"
    }
  ]
}


 
